Revit 2024 API
ScheduleField.GetStyle Method
 Gets the style of this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public TableCellStyle GetStyle()
Visual Basic
Public Function GetStyle As TableCellStyle
Visual C++
public:
TableCellStyle^ GetStyle()
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace